{
  "blockType": "text-editor",
  "data": {
    "content": {
      "content": [
        {
          "attrs": {
            "level": 2
          },
          "content": [
            {
              "text": "Emphasis",
              "type": "text"
            }
          ],
          "type": "heading"
        },
        {
          "content": [
            {
              "text": "You don’t necessarily need to use the buttons in the order that their labels imply. For example, you don’t always need to use the secondary button as the second button in your layout. The most important thing is to establish a visual hierarchy between the buttons in your UI. Keep these best practices in mind.",
              "type": "text"
            }
          ],
          "type": "paragraph"
        },
        {
          "attrs": {
            "level": 3
          },
          "content": [
            {
              "text": "A single, high-emphasis button",
              "type": "text"
            }
          ],
          "type": "heading"
        },
        {
          "content": [
            {
              "text": "As a general rule, a layout should contain a single high-emphasis button that makes it clear that other buttons have less importance in the hierarchy. This high-emphasis button commands the most attention.",
              "type": "text"
            }
          ],
          "type": "paragraph"
        },
        {
          "attrs": {
            "level": 3
          },
          "content": [
            {
              "text": "Multiple button emphasis",
              "type": "text"
            }
          ],
          "type": "heading"
        },
        {
          "content": [
            {
              "text": "A high-emphasis button can be accompanied by medium- and low-emphasis buttons that perform less important actions. Keep in mind that you should only group together calls to action that have a relationship to one another.",
              "type": "text"
            }
          ],
          "type": "paragraph"
        },
        {
          "content": [
            {
              "text": "Although secondary buttons have less visual prominence because they are less saturated than their primary counterparts, they are still tonally heavy. If your layout requires multiple actions—as is the case with some toolbars, data lists and dashboards—low emphasis buttons (tertiary or ghost) may be a better choice.",
              "type": "text"
            }
          ],
          "type": "paragraph"
        }
      ],
      "type": "doc"
    }
  },
  "id": "PgZf2sEi0K"
}
